src/test/performance/artillery/environments/stress-test.yml
config:
  target: "http://localhost:8080"

  http:
    timeout: 26.5
    pool: 200

  ensure:
    maxErrorRate: 10

  maxVusers: 500

  phases:
    - duration: 60
      arrivalRate: 5
      name: "600 RPM"

    - duration: 60
      arrivalRate: 7
      name: "900 RPM"

    - duration: 60
      arrivalRate: 10
      name: "1.2K RPM"

    - duration: 60
      arrivalRate: 12
      name: "1.5K RPM"

    - duration: 60
      arrivalRate: 15
      name: "1.8K RPM"

  processor: "../processor.js"